Tekla.Structures.Drawing.HyperLink
The HyperLink class defines a hyperlink object in a drawing. When a hyperlink is double
clicked, the default browser is launched.
The following example shows how to insert a hyperlink:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
ViewBase _view = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews().Current as ViewBase;
HyperLink link = new HyperLink(_view, new Point(200, 200),
new Uri("http://www.tekla.com"),
"Link to Tekla home page");
link.Insert();
}
}

Tekla.Structures.Drawing.HyperLink.Target
Gets or sets the target.

Tekla.Structures.Drawing.HyperLink.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.Uri,System.String)
Creates a new hyperlink instance using standard attributes.
View: A drawing view.
InsertionPoint: The location for the link.
Target: The link target.
Text: The link text visible to the user.

Tekla.Structures.Drawing.HyperLink.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.Uri,System.String,Tekla.Structures.Drawing.LinkAttributes)
Creates a new hyperlink instance using the given attributes.
View: A drawing view.
InsertionPoint: The location for the link.
Target: The link target.
Text: The link text visible to the user.
Attributes: The attributes for creating the link.

Tekla.Structures.Drawing.HyperLink.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.Uri,System.String,Tekla.Structures.Drawing.Size)
Creates a new hyperlink instance using standard attributes.
View: A drawing view.
InsertionPoint: The location for the link.
Target: The link target.
Text: The link text visible to the user.
Size: The width and height for the link.

Tekla.Structures.Drawing.HyperLink.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.Uri,System.String,Tekla.Structures.Drawing.Size,Tekla.Structures.Drawing.LinkAttributes)
Creates a new hyperlink instance using the given attributes.
View: A drawing view.
InsertionPoint: The location for the link.
Target: The link target.
Text: The link text visible to the user.
Size: The width and height for the link.
Attributes: The attributes for creating the link.

Tekla.Structures.Drawing.HyperLink.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.HyperLink.Insert
Inserts the link.
Returns: True if succeeded.

Tekla.Structures.Drawing.HyperLink.Select
Selects the link.
Returns: True if succeeded.

Tekla.Structures.Drawing.HyperLink.Modify
Modifies the link.
Returns: True if succeeded.

Tekla.Structures.Drawing.HyperLink.Delete
Deletes the link.
Returns: True if succeeded.